koogar/Adafruit_SH1106_ESP32/Adafruit_SH1106_ESP32.cpp
#define swap(a, b) { int16_t t = a; a = b; b = t; }

// the most basic function, set a single pixel
void Adafruit_SH1106_ESP32::drawPixel(int16_t x, int16_t y, uint16_t color) {
  if ((x < 0) || (x >= width()) || (y < 0) || (y >= height()))
    return;

  // check rotation, move pixel around if necessary
  switch (getRotation()) {
  case 1:
    swap(x, y);
    x = WIDTH - x - 1;
    break;
  case 2:
    x = WIDTH - x - 1;
    y = HEIGHT - y - 1;
    break;
  case 3:
    swap(x, y);
    y = HEIGHT - y - 1;
    break;
  }  

  // x is which column
    switch (color) 
    {
      case WHITE:   buffer[x+ (y/8)*SH1106_LCDWIDTH] |=  (1 << (y&7)); break;
      case BLACK:   buffer[x+ (y/8)*SH1106_LCDWIDTH] &= ~(1 << (y&7)); break; 
      case INVERSE: buffer[x+ (y/8)*SH1106_LCDWIDTH] ^=  (1 << (y&7)); break; 
    }
    
}

Adafruit_SH1106_ESP32::Adafruit_SH1106_ESP32(int8_t SID, int8_t SCLK, int8_t DC, int8_t RST, int8_t CS) : Adafruit_GFX(SH1106_LCDWIDTH, SH1106_LCDHEIGHT) {
  cs = CS;
  rst = RST;
  dc = DC;
  sclk = SCLK;
  sid = SID;
  hwSPI = false;
}

// constructor for hardware SPI - we indicate DataCommand, ChipSelect, Reset 
Adafruit_SH1106_ESP32::Adafruit_SH1106_ESP32(int8_t DC, int8_t RST, int8_t CS) : Adafruit_GFX(SH1106_LCDWIDTH, SH1106_LCDHEIGHT) {
  dc = DC;
  rst = RST;
  cs = CS;
  hwSPI = true;
}

// initializer for I2C - we only indicate the reset pin!
Adafruit_SH1106_ESP32::Adafruit_SH1106_ESP32(uint8_t reset) :
Adafruit_GFX(SH1106_LCDWIDTH, SH1106_LCDHEIGHT) {
  sclk = dc = cs = sid = -1;
  rst = reset;
}

Adafruit_SH1106_ESP32::Adafruit_SH1106_ESP32(int8_t SDA, int8_t SCL) :
Adafruit_GFX(SH1106_LCDWIDTH, SH1106_LCDHEIGHT) {
  sclk = dc = cs = sid = -1;
  sda = SDA;
  scl = SCL;
  hwSPI = false;
}

void Adafruit_SH1106_ESP32::begin(uint8_t vccstate, uint8_t i2caddr, bool reset) {
  _vccstate = vccstate;
  _i2caddr = i2caddr;

  // set pin directions
  if (sid != -1){
    pinMode(dc, OUTPUT);
    pinMode(cs, OUTPUT);
    csport      = portOutputRegister(digitalPinToPort(cs));
    cspinmask   = digitalPinToBitMask(cs);
    dcport      = portOutputRegister(digitalPinToPort(dc));
    dcpinmask   = digitalPinToBitMask(dc);
    if (!hwSPI){
      // set pins for software-SPI
      pinMode(sid, OUTPUT);
      pinMode(sclk, OUTPUT);
      clkport     = portOutputRegister(digitalPinToPort(sclk));
      clkpinmask  = digitalPinToBitMask(sclk);
      mosiport    = portOutputRegister(digitalPinToPort(sid));
      mosipinmask = digitalPinToBitMask(sid);
      }
    if (hwSPI){
      SPI.begin ();
#ifdef __SAM3X8E__
      SPI.setClockDivider (9); // 9.3 MHz
#else
      SPI.setClockDivider (SPI_CLOCK_DIV2); // 8 MHz
#endif
      }
    }
  else
  {
    // I2C Init
    if(sda == -1 || scl == -1){
    Wire.begin();
#ifdef __SAM3X8E__
    // Force 400 KHz I2C, rawr! (Uses pins 20, 21 for SDA, SCL)
    TWI1->TWI_CWGR = 0;
    TWI1->TWI_CWGR = ((VARIANT_MCK / (2 * 400000)) - 4) * 0x101;
#endif
    } else {
       Wire.begin(sda, scl); 
    }
  }

  if (reset) {
    // Setup reset pin direction (used by both SPI and I2C)  
    pinMode(rst, OUTPUT);
    digitalWrite(rst, HIGH);
    // VDD (3.3V) goes high at start, lets just chill for a ms
    delay(1);
    // bring reset low
    digitalWrite(rst, LOW);
    // wait 10ms
    delay(10);
    // bring out of reset
    digitalWrite(rst, HIGH);
    // turn on VCC (9V?)
  }

   #if defined SH1106_128_32
    // Init sequence for 128x32 OLED module
    sh1106_command(SH1106_DISPLAYOFF);                    // 0xAE
    sh1106_command(SH1106_SETDISPLAYCLOCKDIV);            // 0xD5
    sh1106_command(0x80);                                  // the suggested ratio 0x80
    sh1106_command(SH1106_SETMULTIPLEX);                  // 0xA8
    sh1106_command(0x1F);
    sh1106_command(SH1106_SETDISPLAYOFFSET);              // 0xD3
    sh1106_command(0x0);                                   // no offset
    sh1106_command(SH1106_SETSTARTLINE | 0x0);            // line #0
    sh1106_command(SH1106_CHARGEPUMP);                    // 0x8D
    if (vccstate == SH1106_EXTERNALVCC) 
      { sh1106_command(0x10); }
    else 
      { sh1106_command(0x14); }
    sh1106_command(SH1106_MEMORYMODE);                    // 0x20
    sh1106_command(0x00);                                  // 0x0 act like ks0108
    sh1106_command(SH1106_SEGREMAP | 0x1);
    sh1106_command(SH1106_COMSCANDEC);
    sh1106_command(SH1106_SETCOMPINS);                    // 0xDA
    sh1106_command(0x02);
    sh1106_command(SH1106_SETCONTRAST);                   // 0x81
    sh1106_command(0x8F);
    sh1106_command(SH1106_SETPRECHARGE);                  // 0xd9
    if (vccstate == SH1106_EXTERNALVCC) 
      { sh1106_command(0x22); }
    else 
      { sh1106_command(0xF1); }
    sh1106_command(SH1106_SETVCOMDETECT);                 // 0xDB
    sh1106_command(0x40);
    sh1106_command(SH1106_DISPLAYALLON_RESUME);           // 0xA4
    sh1106_command(SH1106_NORMALDISPLAY);                 // 0xA6
  #endif

  #if defined SH1106_128_64
    // Init sequence for 128x64 OLED module
    sh1106_command(SH1106_DISPLAYOFF);                    // 0xAE
    sh1106_command(SH1106_SETDISPLAYCLOCKDIV);            // 0xD5
    sh1106_command(0x80);                                  // the suggested ratio 0x80
    sh1106_command(SH1106_SETMULTIPLEX);                  // 0xA8
    sh1106_command(0x3F);
    sh1106_command(SH1106_SETDISPLAYOFFSET);              // 0xD3
    sh1106_command(0x0);                                   // no offset
    sh1106_command(SH1106_SETSTARTLINE | 0x0);            // line #0
    sh1106_command(SH1106_CHARGEPUMP);                    // 0x8D
    if (vccstate == SH1106_EXTERNALVCC) 
      { sh1106_command(0x10); }
    else 
      { sh1106_command(0x14); }
    sh1106_command(SH1106_MEMORYMODE);                    // 0x20
    sh1106_command(0x00);                                  // 0x0 act like ks0108
    sh1106_command(SH1106_SEGREMAP | 0x1);
    sh1106_command(SH1106_COMSCANDEC);
    sh1106_command(SH1106_SETCOMPINS);                    // 0xDA
    sh1106_command(0x12);
    sh1106_command(SH1106_SETCONTRAST);                   // 0x81
    if (vccstate == SH1106_EXTERNALVCC) 
      { sh1106_command(0x9F); }
    else 
      { sh1106_command(0xCF); }
    sh1106_command(SH1106_SETPRECHARGE);                  // 0xd9
    if (vccstate == SH1106_EXTERNALVCC) 
      { sh1106_command(0x22); }
    else 
      { sh1106_command(0xF1); }
    sh1106_command(SH1106_SETVCOMDETECT);                 // 0xDB
    sh1106_command(0x40);
    sh1106_command(SH1106_DISPLAYALLON_RESUME);           // 0xA4
    sh1106_command(SH1106_NORMALDISPLAY);                 // 0xA6
  #endif

  #if defined SH1106_96_16
    // Init sequence for 96x16 OLED module
    sh1106_command(SH1106_DISPLAYOFF);                    // 0xAE
    sh1106_command(SH1106_SETDISPLAYCLOCKDIV);            // 0xD5
    sh1106_command(0x80);                                  // the suggested ratio 0x80
    sh1106_command(SH1106_SETMULTIPLEX);                  // 0xA8
    sh1106_command(0x0F);
    sh1106_command(SH1106_SETDISPLAYOFFSET);              // 0xD3
    sh1106_command(0x00);                                   // no offset
    sh1106_command(SH1106_SETSTARTLINE | 0x0);            // line #0
    sh1106_command(SH1106_CHARGEPUMP);                    // 0x8D
    if (vccstate == SH1106_EXTERNALVCC) 
      { sh1106_command(0x10); }
    else 
      { sh1106_command(0x14); }
    sh1106_command(SH1106_MEMORYMODE);                    // 0x20
    sh1106_command(0x00);                                  // 0x0 act like ks0108
    sh1106_command(SH1106_SEGREMAP | 0x1);
    sh1106_command(SH1106_COMSCANDEC);
    sh1106_command(SH1106_SETCOMPINS);                    // 0xDA
    sh1106_command(0x2);	//ada x12
    sh1106_command(SH1106_SETCONTRAST);                   // 0x81
    if (vccstate == SH1106_EXTERNALVCC) 
      { sh1106_command(0x10); }
    else 
      { sh1106_command(0xAF); }
    sh1106_command(SH1106_SETPRECHARGE);                  // 0xd9
    if (vccstate == SH1106_EXTERNALVCC) 
      { sh1106_command(0x22); }
    else 
      { sh1106_command(0xF1); }
    sh1106_command(SH1106_SETVCOMDETECT);                 // 0xDB
    sh1106_command(0x40);
    sh1106_command(SH1106_DISPLAYALLON_RESUME);           // 0xA4
    sh1106_command(SH1106_NORMALDISPLAY);                 // 0xA6
  #endif

  sh1106_command(SH1106_DISPLAYON);//--turn on oled panel
}


void Adafruit_SH1106_ESP32::invertDisplay(uint8_t i) {
  if (i) {
    sh1106_command(SH1106_INVERTDISPLAY);
  } else {
    sh1106_command(SH1106_NORMALDISPLAY);
  }
}

void Adafruit_SH1106_ESP32::sh1106_command(uint8_t c) { 
  if (sid != -1)
  {
    // SPI
    //digitalWrite(cs, HIGH);
    *csport |= cspinmask;
    //digitalWrite(dc, LOW);
    *dcport &= ~dcpinmask;
    //digitalWrite(cs, LOW);
    *csport &= ~cspinmask;
    fastSPIwrite(c);
    //digitalWrite(cs, HIGH);
    *csport |= cspinmask;
  }
  else
  {
    // I2C
    uint8_t control = 0x00;   // Co = 0, D/C = 0
    Wire.beginTransmission(_i2caddr);
    WIRE_WRITE(control);
    WIRE_WRITE(c);
    Wire.endTransmission();
  }
}

